FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_SPI.c
    // RSPI Clock Delay Register (SPCKD)
    //  0000 0---   Reserved
    //  ---- -abc   SCKDL[2:0] = 1 RSPCK + abc (0+1=1 in this case)
    p->SPCKD.BYTE = 0x00;

    // RSPI Slave Select Negation Delay Register (SSLND)
    //  0000 0---   Reserved
    //  ---- -abc   SLNDL[2:0] = 1 RSPCK + abc (0+1=1 in this case)
    p->SSLND.BYTE = 0x00;

    // RSPI Next-Access Delay Register (SPND)
    //  0000 0---   Reserved
    //  ---- -abc   SPNDL[2:0] = 1 RSPCK + abc + 2 PCLK
    //              (0+1=1 RSPCK + 2 PCLK in this case)
    p->SPND.BYTE = 0x00;

    // SPCR2: RSPI Control Register 2
    //  0000 ----   Reserved
    //  ---- 0---   PTE = Disables the self-diagnosis function of the parity
    //                  circuit
    //  ---- -0--   SPIIE = Disables the generation of idle interrupt requests
    //  ---- --0-   SPOE = Selects even parity for use in transmission and
    //                  reception (not used)
    //  ---- ---0   SPPE = Does not add the parity bit to transmit data and
    //                  does not check the parity bit of receive data
    p->SPCR2.BYTE = 0x00;

    // SPCMD0: RSPI Command Register 0
    //  0--- ---- ---- ---- SCKDEN = An RSPCK delay of 1 RSPCK
    //  -0-- ---- ---- ---- SLNDEN = An SSL negation delay of 1 RSPCK
    //  --0- ---- ---- ---- SPNDEN = A next-access delay of 1 RSPCK + 2 PCLK
    //  ---0 ---- ---- ---- LSBF = MSB first
    //  ---- xxxx ---- ---- SPB[3:0] = Number of bits per transfer
    //                          0:      20 bits,
    //                          1:      24 bits,
    //                          2-3:    32 bits
    //                          4-7:    8 bits,
    //                          8-15:   9 to 16 bits,
    //  ---- ---- 0--- ---- SSLKP = Negates all SSL signals upon completion of
    //                          transfer (not used)
    //  ---- ---- -000 ---- SSLA[2:0]:
    //                          0:      SSL0
    //                          1:      SSL1
    //                          2:      SSL2
    //                          3:      SSL3
    //                          4-7:    Prohibited
    //  ---- ---- ---- 00-- BRDV[1:0]: These bits select the base bit rate
    //  ---- ---- ---- --x- CPOL = RSPCK Polarity Setting
    //                          0:      RSPCK=0 when idle
    //                          1:      RSPCK=1 when idle
    //  ---- ---- ---- ---x CPHA = RSPCK Phase Setting
    //                          0:      Data sampling on odd edge, data
    //                                  variation on even edge
    //                          1:      Data variation on odd edge, data
    //                                  sampling on even edge
    if (aRequest->iBitsPerTransfer<32)
        p->SPCMD0.WORD =
            (G_bitMapping[aRequest->iBitsPerTransfer]<<8) |
            (aRequest->iClockOutPhase?(1<<0):0) |
            (aRequest->iClockOutPolarity?(1<<1):0);
    else
        p->SPCMD0.WORD = 0x0700; // 8 bit default

    // SPCR: RSPI Control Register
    //  0--- ----   SPRIE = Disables the generation of RSPI receive interrupt
    //                  requests
    //  -1-- ----   SPE = Enables the RSPI function
    //  --0- ----   SPTIE = Disables the generation of RSPI transmit interrupt
    //                  requests
    //  ---0 ----   SPEIE = Disables the generation of RSPI error interrupt
    //                  requests
    //  ---- 1---   MSTR = Master mode
    //  ---- -0--   MODFEN = Disables the detection of mode fault error
    //  ---- --0-   TXMD = Full-duplex synchronous serial communications
    //  ---- ---1   SPMS = SPI operation (3-wire method)
    p->SPCR.BYTE = 0x69; // 0x49 ;

    // SSLP: RSPI Slave Select Polarity Register (SSLP)
    //  0000 ----   Reserved
    //  ---- 0---   SSL3P = SSL3 signal is 0-active (not used)
    //  ---- -0--   SSL2P = SSL2 signal is 0-active (not used)
    //  ---- --0-   SSL1P = SSL1 signal is 0-active (not used)
    //  ---- ---0   SSL0P = SSL0 signal is 0-active (not used)
    p->SSLP.BYTE = 0x00;

    // RSPI Sequence Control Register (SPSCR)
    //  0000 0---   Reserved
    //  ---- -000   SPSLN[2:0]
    //                  000: 1 0 -> 0 -> ...
    //                  001: 1 0 -> 1 -> 0 -> ...
    //                  ...
    //                  111: 1 0 -> 1 -> 2 -> 3 -> 4 -> 5 -> 6 -> 7 -> 0 -> ...
    p->SPSCR.BYTE = 0x00;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_TransferPolled
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a SPI transfer (both read and write) out the SPI port using
 *      the given request.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request to perform
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_SPI_TransferPolled(void *aWorkspace, SPI_Request *aRequest)
{
    TUInt32 i;
    T_RX63N_SPI_Workspace *aW = (T_RX63N_SPI_Workspace *)aWorkspace;
    T_RX63N_SPI_Registers *p = aW->iReg;
    TUInt8 *p_dataMOSI8;
    TUInt8 *p_dataMISO8;
    TUInt16 *p_dataMOSI16;
    TUInt16 *p_dataMISO16;
    TUInt32 *p_dataMOSI32;
    TUInt32 *p_dataMISO32;
    volatile TUInt32 dummy;
    TUInt32 send;

    // Setup SPI for this configuration
    ISPIConfig(aW, aRequest);

    // Start SPI
    ISPIStart(aRequest);

    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8)  {
        // Doing 8-bit bytes
        p_dataMOSI8 = (TUInt8 *)(aRequest->iDataMOSI);
        p_dataMISO8 = (TUInt8 *)(aRequest->iDataMISO);

        if (p_dataMOSI8) {
            if (p_dataMISO8) {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    send = (TUInt32)*(p_dataMOSI8++);
                    //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                    //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
					p->SPDR = send << 16;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    *(p_dataMISO8++) = p->SPDR >> 16;
                }
            } else {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    send = (TUInt32)*(p_dataMOSI8++);
                    //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                    //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
					p->SPDR = send << 16;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    dummy = p->SPDR >> 16;
                }
            }
        } else {
            if (p_dataMISO8) {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    //p->SPDR.WORD.L = 0xFFFF;
                    //p->SPDR.WORD.H = 0xFFFF;
					p->SPDR = 0xFFFFFFFF;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    *(p_dataMISO8++) = p->SPDR >> 16;
                }
            } else {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    //p->SPDR.WORD.L = 0xFFFF;
                    //p->SPDR.WORD.H = 0xFFFF;
					p->SPDR = 0xFFFFFFFF;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    dummy = p->SPDR >> 16;
                }
            }
        }
    } else if (aRequest->iBitsPerTransfer <= 16) {
        // Doing 16-bit words
        p_dataMOSI16 = (TUInt16 *)(aRequest->iDataMOSI);
        p_dataMISO16 = (TUInt16 *)(aRequest->iDataMISO);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Send the SPI data (this also triggers a read in)
            if (p_dataMOSI16) {
                send = (TUInt32)*(p_dataMOSI16++);
                //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
				p->SPDR = send << 16;
            } else {
                //p->SPDR.WORD.L = 0xFFFF;
                //p->SPDR.WORD.H = 0xFFFF;
				p->SPDR = 0xFFFFFFFF;
            }
            // Wait until SPI done 
            while (p->SPSR.BIT.IDLNF);

            // Store the SPI received over the data sent
            if (p_dataMISO16)
                *(p_dataMISO16++) = p->SPDR >> 16;
            else
                dummy = p->SPDR >> 16;
        }
    } else {
        // Doing 32-bit words
        p_dataMOSI32 = (TUInt32 *)(aRequest->iDataMOSI);
        p_dataMISO32 = (TUInt32 *)(aRequest->iDataMISO);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Send the SPI data (this also triggers a read in)
            if (p_dataMOSI32) {
                send = (TUInt32)*(p_dataMOSI32++);
                //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
				p->SPDR = send;
            } else {
                //p->SPDR.WORD.L = 0xFFFF;
                //p->SPDR.WORD.H = 0xFFFF;
				p->SPDR = 0xFFFFFFFF;
            }

            // Wait until SPI done
            while (p->SPSR.BIT.IDLNF);

            // Store the SPI received over the data sent
            if (p_dataMISO32)
                *(p_dataMISO32++) = p->SPDR;
            else
                dummy = p->SPDR;
        }
    }

    // End SPI
    ISPIEnd(aRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_TransferInOutBytes
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a SPI transfer (both read and write) out the SPI port using
 *      the given request.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request to perform
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_SPI_TransferInOutBytes(void *aWorkspace, SPI_Request *aRequest)
{
    TUInt32 i;
    T_RX63N_SPI_Workspace *aW = (T_RX63N_SPI_Workspace *)aWorkspace;
    T_RX63N_SPI_Registers *p = aW->iReg;
    TUInt8 *p_dataMOSI8;
    TUInt8 *p_dataMISO8;
    TUInt16 *p_dataMOSI16;
    TUInt16 *p_dataMISO16;
    TUInt32 *p_dataMOSI32;
    TUInt32 *p_dataMISO32;
    volatile TUInt32 dummy;
    TUInt32 send;

    ISPIConfig(aWorkspace, aRequest);
    
