FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_SPI.c
    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8)  {
        // Doing 8-bit bytes
        p_dataMOSI8 = (TUInt8 *)(aRequest->iDataMOSI);
        p_dataMISO8 = (TUInt8 *)(aRequest->iDataMISO);

        if (p_dataMOSI8) {
            if (p_dataMISO8) {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    send = (TUInt32)*(p_dataMOSI8++);
                    //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                    //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
					p->SPDR = send << 16;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    *(p_dataMISO8++) = p->SPDR >> 16;
                }
            } else {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    send = (TUInt32)*(p_dataMOSI8++);
                    //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                    //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
					p->SPDR = send << 16;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    dummy = p->SPDR >> 16;
                }
            }
        } else {
            if (p_dataMISO8) {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    //p->SPDR.WORD.L = 0xFFFF;
                    //p->SPDR.WORD.H = 0xFFFF;
					p->SPDR = 0xFFFFFFFF;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    *(p_dataMISO8++) = p->SPDR >> 16;
                }
            } else {
                for (i=0; i<aRequest->iNumTransfers; i++)  {
                    // Send the SPI data (this also triggers a read in)
                    //p->SPDR.WORD.L = 0xFFFF;
                    //p->SPDR.WORD.H = 0xFFFF;
					p->SPDR = 0xFFFFFFFF;

                    // Wait until SPI done 
                    while (p->SPSR.BIT.IDLNF);

                    // Store the SPI received over the data sent
                    dummy = p->SPDR >> 16;
                }
            }
        }
    } else if (aRequest->iBitsPerTransfer <= 16) {
        // Doing 16-bit words
        p_dataMOSI16 = (TUInt16 *)(aRequest->iDataMOSI);
        p_dataMISO16 = (TUInt16 *)(aRequest->iDataMISO);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Send the SPI data (this also triggers a read in)
            if (p_dataMOSI16) {
                send = (TUInt32)*(p_dataMOSI16++);
                //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
				p->SPDR = send << 16;
            } else {
                //p->SPDR.WORD.L = 0xFFFF;
                //p->SPDR.WORD.H = 0xFFFF;
				p->SPDR = 0xFFFFFFFF;
            }
            // Wait until SPI done 
            while (p->SPSR.BIT.IDLNF);

            // Store the SPI received over the data sent
            if (p_dataMISO16)
                *(p_dataMISO16++) = p->SPDR >> 16;
            else
                dummy = p->SPDR >> 16;
        }
    } else {
        // Doing 32-bit words
        p_dataMOSI32 = (TUInt32 *)(aRequest->iDataMOSI);
        p_dataMISO32 = (TUInt32 *)(aRequest->iDataMISO);

        for (i=0; i<aRequest->iNumTransfers; i++)  {
            // Send the SPI data (this also triggers a read in)
            if (p_dataMOSI32) {
                send = (TUInt32)*(p_dataMOSI32++);
                //p->SPDR.WORD.L = (TUInt16) (send >> 16);
                //p->SPDR.WORD.H = (TUInt16) (send & 0xFFFF);
				p->SPDR = send;
            } else {
                //p->SPDR.WORD.L = 0xFFFF;
                //p->SPDR.WORD.H = 0xFFFF;
				p->SPDR = 0xFFFFFFFF;
            }

            // Wait until SPI done
            while (p->SPSR.BIT.IDLNF);

            // Store the SPI received over the data sent
            if (p_dataMISO32)
                *(p_dataMISO32++) = p->SPDR;
            else
                dummy = p->SPDR;
        }
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_RSPI0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N SPI0 workspace.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_SPI_RSPI0_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_SPI_Workspace *p = (T_RX63N_SPI_Workspace *)aWorkspace;

    p->iReg = &RSPI0;
    p->iMSTPBit = 17;
    ISPIConfig(aWorkspace, (SPI_Request *)&G_defaultSPIRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_RSPI1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N SPI1 workspace.
 * Inputs:
 *      void *aWorkspace            -- Particular SPI workspace
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_SPI_RSPI1_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_SPI_Workspace *p = (T_RX63N_SPI_Workspace *)aWorkspace;

    p->iReg = &RSPI1;
    p->iMSTPBit = 16;
    ISPIConfig(aWorkspace, (SPI_Request *)&G_defaultSPIRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Start a SPI transfer by configuring for the speed and settings
 *      and then activating the chip select.
 * Inputs:
 *      void *aWorkspace            -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request settings to process
 * Outputs:
 *      T_uezError                  -- Error code
 *---------------------------------------------------------------------------*/
void RX63N_SPI_Start(void *aWorkspace, SPI_Request *aRequest)
{
    // Setup SPI for this configuration
    ISPIConfig(aWorkspace, aRequest);
    ISPIStart(aRequest);
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_TransferInOut
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a SPI transfer (that has already been started) and transfer
 *      a request full of data.
 * Inputs:
 *      void *aWorkspace            -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request settings to process
 *      TUInt32 aSend               -- Data on the send side
 * Outputs:
 *      TUInt32                     -- Returned data
 *---------------------------------------------------------------------------*/
TUInt32 RX63N_SPI_TransferInOut(
        void *aWorkspace, 
        SPI_Request *aRequest, 
        TUInt32 aSend)
{
    TUInt32 recv;
    T_RX63N_SPI_Workspace *aW = (T_RX63N_SPI_Workspace *)aWorkspace;
    T_RX63N_SPI_Registers *p = aW->iReg;

