FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_SPI.c
    // Doing one transfer
    // Send the SPI data (this also triggers a read in)
    //p->SPDR.WORD.L = (TUInt16) (aSend >> 16);
    //p->SPDR.WORD.H = (TUInt16) (aSend & 0xFFFF);
	p->SPDR = aSend << 16;

    // Wait until SPI done
    while (p->SPSR.BIT.IDLNF);

    recv = p->SPDR >> 16;

    return recv;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_SPI_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      The SPI transfer(s) are complete.  End the SPI by flipping
 *      the chip select.
 * Inputs:
 *      void *aWorkspace            -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request settings to process
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
void RX63N_SPI_Stop(
        void *aWorkspace,
        SPI_Request *aRequest)
{
    ISPIEnd(aRequest);
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SPI SPI_RX63N_RSPI0_Interface = {
    "RX63N:SPI0",
    0x0100,
    RX63N_SPI_RSPI0_InitializeWorkspace,
    sizeof(T_RX63N_SPI_Workspace),

    RX63N_SPI_TransferPolled,

    RX63N_SPI_Start,
    RX63N_SPI_TransferInOut,
    RX63N_SPI_Stop,
    RX63N_SPI_TransferInOutBytes,
};

const HAL_SPI SPI_RX63N_RSPI1_Interface = {
    "RX63N:SPI1",
    0x0100,
    RX63N_SPI_RSPI1_InitializeWorkspace,
    sizeof(T_RX63N_SPI_Workspace),

    RX63N_SPI_TransferPolled,

    RX63N_SPI_Start,
    RX63N_SPI_TransferInOut,
    RX63N_SPI_Stop,
    RX63N_SPI_TransferInOutBytes,
};

void RX63N_RSPI0_Require(
	T_uezGPIOPortPin aPinRSPCK,
	T_uezGPIOPortPin aPinMOSI,
	T_uezGPIOPortPin aPinMISO)
{
	static const T_RX63N_MPC_ConfigList clkList[] = {
            {GPIO_PC5, 0x0D},
			{GPIO_PA5, 0x0D},
    };
    static const T_RX63N_MPC_ConfigList mosiList[] = {
            {GPIO_PC6, 0x0D},
			{GPIO_PA6, 0x0D},
    };
	static const T_RX63N_MPC_ConfigList misoList[] = {
            {GPIO_PC7, 0x0D},
			{GPIO_PA7, 0x0D},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI0", (T_halInterface *)&SPI_RX63N_RSPI0_Interface, 0, 0);

	RX63N_MPC_ConfigPinOrNone(aPinRSPCK, clkList, ARRAY_COUNT(clkList));
	RX63N_MPC_ConfigPinOrNone(aPinMOSI, mosiList, ARRAY_COUNT(mosiList));
	RX63N_MPC_ConfigPinOrNone(aPinMISO, misoList, ARRAY_COUNT(misoList));
}

void RX63N_RSPI1_Require(
	T_uezGPIOPortPin aPinRSPCK,
	T_uezGPIOPortPin aPinMOSI,
	T_uezGPIOPortPin aPinMISO)
{
	static const T_RX63N_MPC_ConfigList clkList[] = {
            {GPIO_PE1, 0x0D},
			{GPIO_PE5, 0x0D},
			{GPIO_P27, 0x0D},
    };
    static const T_RX63N_MPC_ConfigList mosiList[] = {
            {GPIO_PE2, 0x0D},
			{GPIO_PE6, 0x0D},
			{GPIO_P26, 0x0D},
    };
	static const T_RX63N_MPC_ConfigList misoList[] = {
            {GPIO_PE3, 0x0D},
			{GPIO_PE7, 0x0D},
			{GPIO_P30, 0x0D},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RSPI1", (T_halInterface *)&SPI_RX63N_RSPI1_Interface, 0, 0);

	RX63N_MPC_ConfigPinOrNone(aPinRSPCK, clkList, ARRAY_COUNT(clkList));
	RX63N_MPC_ConfigPinOrNone(aPinMOSI, mosiList, ARRAY_COUNT(mosiList));
	RX63N_MPC_ConfigPinOrNone(aPinMISO, misoList, ARRAY_COUNT(misoList));
}

/*-------------------------------------------------------------------------*
 * End of File:  RX63N_SPI.c
 *-------------------------------------------------------------------------*/

